{"loss": "binary_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 1667], "trainable": true, "name": "dropout_39", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_39", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 833}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_40"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_40", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}], "sample_weight_mode": null}